app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM `tasks` WHERE (`tasks`.user_id = 4)