app/controllers/tasks_controller.rb

  def create
    @task = Task.new params[:task]
    @task.user_id = @current_user.id
    if @task.save
---
INSERT INTO `tasks` (`created_at`, `updated_at`, `started`, `user_id`, `description`, `length`) VALUES('2010-09-10 01:47:17', '2010-09-10 01:47:17', NULL, 4, 'Something', 4)

  def start
    @task = Task.find params[:id]
    @task.started = DateTime.now
    @task.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 4)
UPDATE `tasks` SET `started` = '2010-09-10 02:23:27', `updated_at` = '2010-09-10 02:23:27' WHERE `id` = 4

  def stop
    @task = Task.find params[:id]
    @task.started = nil
    @task.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 4)
UPDATE `tasks` SET `started` = NULL, `updated_at` = '2010-09-10 02:23:48' WHERE `id` = 4