app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('eRHIhPt73XvcQR36ADu', '2010-09-09 19:52:52', '2010-09-09 19:52:52', '0ec3539c1c855eddc0438b171288117505189a7524afe67a3fe7ac9e6b33cffb7a2839f543d219ef0255eacfa0e445f12da88cda94acbe7a8f71ed717be38f82', '8IgCRh8fDOYGzAi6fLYN', '2010-09-09 19:52:52', 0, '127.0.0.1', 'duXUG7Aa9piSc7qFggt', '2010-09-09 19:52:52', '9a372affdcaf75e4440babb50374ca5101933b49e15ccf6226bcda010942c39680ea84aca9dba56ac9b7842dd4ef8cc5889c06d3f4ed5f4d1af81e85d4072b4b', 1, NULL, 'tyler', NULL, 'tyler@hotmethod.com')
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 6 )
SELECT `users`.id FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
---
  def create
    @user = User.new(params[:user])
    if @user.save
      @user.roles << Role.find(:first, :conditions => { :title => "member" })

SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 1 )
---
  def edit
    @user = get_user
    @is_admin = false #@user.roles.select{|r|r.title == "administrator"}.length > 0

UPDATE `users` SET `updated_at` = '2010-09-06 05:34:59', `perishable_token` = '7fXOVEt5M6f1KK9S2M4', `last_request_at` = '2010-09-06 05:34:59' WHERE `id` = 1
---
  def update
    @user = get_user
    if @user.update_attributes(params[:user])